In [2]:
import numpy  as np
#pip install numpy
#pip3 install numpy

import pandas as pd

people = {
    "names": ('Alvaro', 'Ana', 'Luzia', 'James', 'Brendan', 'Sarah'),
    "ages": (25, 26, 25, 32, 34, np.NaN)
}
new_people_dataframe = pd.DataFrame(people)
new_people_dataframe

     names  ages
0   Alvaro  25.0
1      Ana  26.0
2    Luzia  25.0
3    James  32.0
4  Brendan  34.0
5    Sarah   NaN

In [5]:
np.NaN # To refer to values not available in out dataframe. Missing values

new_people_dataframe['ages'].isna()

0    False
1    False
2    False
3    False
4    False
5     True
Name: ages, dtype: bool

In [6]:
new_people_dataframe[new_people_dataframe['ages'].isna()]

   names  ages
5  Sarah   NaN

In [9]:
#new_people_dataframe['ages']=new_people_dataframe['ages'].fillna(-99)
new_people_dataframe['ages'].fillna(-99)

0    25.0
1    26.0
2    25.0
3    32.0
4    34.0
5   -99.0
Name: ages, dtype: float64

In [10]:
new_people_dataframe

     names  ages
0   Alvaro  25.0
1      Ana  26.0
2    Luzia  25.0
3    James  32.0
4  Brendan  34.0
5    Sarah   NaN

In [15]:
new_people_dataframe.replace(np.NaN, 10)

     names  ages
0   Alvaro  25.0
1      Ana  26.0
2    Luzia  25.0
3    James  32.0
4  Brendan  34.0
5    Sarah  10.0

In [16]:
# Missing values may have different meanings.
new_people_dataframe.dropna()

     names  ages
0   Alvaro  25.0
1      Ana  26.0
2    Luzia  25.0
3    James  32.0
4  Brendan  34.0

In [21]:
new_people_dataframe['ages'].apply( lambda age: -99 if np.isnan(age) else age )

0    25.0
1    26.0
2    25.0
3    32.0
4    34.0
5   -99.0
Name: ages, dtype: float64

In [22]:
# Basic statistics

new_people_dataframe

     names  ages
0   Alvaro  25.0
1      Ana  26.0
2    Luzia  25.0
3    James  32.0
4  Brendan  34.0
5    Sarah   NaN

In [23]:
new_people_dataframe['ages'].cumsum()

0     25.0
1     51.0
2     76.0
3    108.0
4    142.0
5      NaN
Name: ages, dtype: float64

In [24]:
new_people_dataframe['ages'].unique()

array([25., 26., 32., 34., nan])

In [25]:
# frecuency table
new_people_dataframe['ages'].value_counts()

25.0    2
26.0    1
32.0    1
34.0    1
Name: ages, dtype: int64

In [26]:
# SELECT ages, count(*)
# FROM MY_TABLE
# GROUP BY ages;
new_people_dataframe['ages'].mean()

28.4

In [29]:

new_people_dataframe['ages'].max()

34.0

In [30]:
new_people_dataframe['ages'].min()

25.0

In [31]:

new_people_dataframe['ages'].median()

26.0

In [32]:
new_people_dataframe['ages'].std()

4.277849927241488

In [34]:
new_people_dataframe['ages'].mean()- new_people_dataframe['ages'].std()

24.12215007275851

In [35]:
new_people_dataframe['ages'].mean()+ new_people_dataframe['ages'].std()

32.67784992724149

In [37]:
# At least 50%, most of the people, is in a range of 1 std from the mean:
# Most of the people are between 24 and 32 years old

result=new_people_dataframe.groupby('ages')

result.size()

ages
25.0    2
26.0    1
32.0    1
34.0    1
dtype: int64

In [38]:

people = {
    "names": ('Alvaro', 'Ana', 'Alvaro', 'Ana', 'Alvaro', 'Ana'),
    "salary": (5005, 6006, 5050, 6060, 5100, 6200)
}
new_people_dataframe = pd.DataFrame(people)
new_people_dataframe

    names  salary
0  Alvaro    5005
1     Ana    6006
2  Alvaro    5050
3     Ana    6060
4  Alvaro    5100
5     Ana    6200

In [42]:
grouped_result=new_people_dataframe.groupby('names')

In [43]:
grouped_result.size()

names
Alvaro    3
Ana       3
dtype: int64

In [46]:
grouped_result.describe()

       salary
        count         mean         std     min     25%     50%     75%     max
names
Alvaro    3.0  5051.666667   47.521925  5005.0  5027.5  5050.0  5075.0  5100.0
Ana       3.0  6088.666667  100.126587  6006.0  6033.0  6060.0  6130.0  6200.0

In [47]:

people = {
    "names": ('Alvaro', 'Ana', 'Luzia', 'James', 'Brendan', 'Sarah'),
    "ages": (25, 26, 25, 32, 34, np.NaN)
}
new_people_dataframe = pd.DataFrame(people)
new_people_dataframe

     names  ages
0   Alvaro  25.0
1      Ana  26.0
2    Luzia  25.0
3    James  32.0
4  Brendan  34.0
5    Sarah   NaN

In [49]:
# Functions to group/split the data

pd.cut( new_people_dataframe['ages'] , (-1, 10, 20, 26, 30, 33, 200), labels=['A', 'B', 'C', 'D', 'E', 'F'])

0      C
1      C
2      C
3      E
4      F
5    NaN
Name: ages, dtype: category
Categories (6, object): ['A' < 'B' < 'C' < 'D' < 'E' < 'F']

In [51]:
pd.qcut( new_people_dataframe['ages'] , 2, labels=['A', 'B', 'C'])

0      A
1      B
2      A
3      C
4      C
5    NaN
Name: ages, dtype: category
Categories (3, object): ['A' < 'B' < 'C']

In [53]:
pd.cut( new_people_dataframe['ages'] , (-1, 30, 200), labels=['A', 'B'])

0      A
1      A
2      A
3      B
4      B
5    NaN
Name: ages, dtype: category
Categories (2, object): ['A' < 'B']

In [57]:
pd.cut( new_people_dataframe['ages'] , 2 , labels=['A', 'B'])

0      A
1      A
2      A
3      B
4      B
5    NaN
Name: ages, dtype: category
Categories (2, object): ['A' < 'B']